OdIfc.OdIfcGeomModule.unregisterExternalCompound(OdIfc.OdIfcEntityType,OdRxClass*)
\details
Unregisters an external OdIfc::OdIfcCompound class from IFC geometry module.
\param entityType [in] An IFC entity type with whom ifcCompoundClass is associated.
\param ifcCompoundClass [in] An instance of OdRxClass to unregister.
\returns True if unregistered successfully; otherwise the method returns false.

OdIfc.OdIfcGeomModule.registerExternalCompound(OdIfc.OdIfcEntityType,OdRxClass*)
\details
Registers an external OdIfc::OdIfcCompound class for geometry compose.
\param entityType [in] An IFC entity type to associate ifcCompoundClass with.
\param ifcCompoundClass [in] An instance of OdRxClass for OdIfc::OdIfcCompound implementation.
\returns True if registered successfully; otherwise the method returns false.

OdIfc.OdIfcGeomModule.getIfcEntResolver
\details
Retrieves the current entity resolver object assigned to the module.
\returns Returns a raw pointer to the entity resolver object.

OdIfc.OdIfcGeomModule.uninitApp
\details
De-initializes the IFC geometry module.

OdIfc.OdIfcGeomModule.initApp
\details
Initializes the IFC geometry module.

OdIfc.OdIfcGeomModule
\details
A class that implements a module for working with IFC geometry.